Шаблоны/Request_1004.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:smev="http://smev.gosuslugi.ru/rev120315" xmlns:pfr="http://pfr.skmv.rstyle.com" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns="http://sum-soc-help.skmv.rstyle.com">
  <soap:Body wsu:Id="body">
     <ResidencePermit>
      <smev:Message>
        <smev:Sender>
          <smev:Code>#SND_CODE#</smev:Code>
          <smev:Name>#SND_NAME#</smev:Name>
        </smev:Sender>
        <smev:Recipient>
          <smev:Code>#SND_CODE#</smev:Code>
          <smev:Name>#SND_NAME#</smev:Name>
        </smev:Recipient>
        <smev:Originator>
          <smev:Code>#SND_CODE#</smev:Code>
          <smev:Name>#SND_NAME#</smev:Name>
        </smev:Originator>
        <smev:ServiceName>TestMnemonic</smev:ServiceName>
        <smev:TypeCode>GSRV</smev:TypeCode>
        <smev:Status>REQUEST</smev:Status>
        <smev:Date>#DATE#</smev:Date>
        <smev:ExchangeType>2</smev:ExchangeType>
        <smev:TestMsg>Test</smev:TestMsg>
        <smev:OKTMO>#OKTMO#</smev:OKTMO>
      </smev:Message>
      <smev:MessageData>
         <smev:AppData>
            <ResidencePermitRequest>
                #INSERT#
                <Citizenship>Узбекинстан</Citizenship>
                <IdentityDocument>
                    <Type>Паспорт</Type>
                    <Series>1111</Series>
                    <Number>222222</Number>
                    <IssuedDate>01.10.2010</IssuedDate>
		            <IssuedBy>Тестовый РОВД</IssuedBy>
                </IdentityDocument>
                <ResidenceAddress>
                     <RegionCode>77</RegionCode>
                     <Region>Москва</Region>
                     <Area>Тушинский</Area>
                     <Locality>Москва</Locality>
                     <Street>Свободы</Street>
                     <House>6</House>
                     <Housing>7</Housing>
		             <Building/>
                     <Apartment>8</Apartment>
                </ResidenceAddress>
                <Jobs>
                    <JobInfo>
			            <DateBegin>20.11.2010</DateBegin>
			            <DataEnd>31.12.2013</DataEnd>
			            <OrganizName>ЖЭУ №3</OrganizName>
                    </JobInfo>
                    <JobInfo>
			            <DateBegin>20.01.2014</DateBegin>
			            <DataEnd/>
			            <OrganizName>УК "Лопаты и грабли"</OrganizName>
                    </JobInfo>
                </Jobs>
            </ResidencePermitRequest>
         </smev:AppData>
      </smev:MessageData>
    </ResidencePermit>
  </soap:Body>
</soap:Envelope>
